# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2025-02-10 20:55:51 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TAGS: web(w)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* Snoopy [7/11]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
  Snoopy is a naive desktop search engine for your files. It aims to be gentle
  on resource usage, index both file names, types, and metadata/content where
  feasible.
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 202 :emphasize t
   #+CAPTION: Clock summary at [2025-02-10 Mo 20:55]
   | Headline                                     | Time      |            |       |      |
   |----------------------------------------------+-----------+------------+-------+------|
   | *Total time*                                 | *3d 4:56* |            |       |      |
   |----------------------------------------------+-----------+------------+-------+------|
   | *Snoopy [7/11]*                              | *3d 4:56* |            |       |      |
   | \_  /Components [6/10]/                      |           | /2d 23:52/ |       |      |
   | \_    Main [1/1]                             |           |            |  0:06 |      |
   | \_      Prune log file on startup            |           |            |       | 0:06 |
   | \_    Data model [0/0]                       |           |            |  0:37 |      |
   | \_    Database [4/5]                         |           |            | 11:25 |      |
   | \_      How big should the pool be?          |           |            |       | 0:12 |
   | \_      Prune                                |           |            |       | 1:52 |
   | \_      Global connection pool               |           |            |       | 0:26 |
   | \_      Relative paths                       |           |            |       | 2:09 |
   | \_    Blacklist [0/0]                        |           |            |  2:51 |      |
   | \_    Walker [0/0]                           |           |            | 10:58 |      |
   | \_    Extractor [1/1]                        |           |            | 21:22 |      |
   | \_      Resolution of images and possibly... |           |            |       | 2:49 |
   | \_    UI [0/1]                               |           |            | 17:32 |      |
   | \_      Edit Blacklist from GUI              |           |            |       | 0:43 |
   | \_    Searching [0/2]                        |           |            |  7:01 |      |
   | \_  /Bugs [1/1]/                             |           | /5:04/     |       |      |
   | \_    GUI hangs after extractor runs         |           |            |  5:04 |      |
   #+END:
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [6/10]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Main [1/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
**** DONE Prune log file on startup
     CLOSED: [2025-02-10 Mo 19:56]
     :LOGBOOK:
     CLOCK: [2025-02-10 Mo 19:50]--[2025-02-10 Mo 19:56] =>  0:06
     :END:
*** Data model [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2024-12-22 So 15:33]--[2024-12-22 So 16:10] =>  0:37
    :END:
*** Database [4/5]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-01-13 Mo 15:17]--[2025-01-13 Mo 15:25] =>  0:08
    CLOCK: [2025-01-12 So 10:31]--[2025-01-12 So 11:01] =>  0:30
    CLOCK: [2025-01-11 Sa 17:55]--[2025-01-11 Sa 18:13] =>  0:18
    CLOCK: [2025-01-10 Fr 22:04]--[2025-01-11 Sa 00:41] =>  2:37
    CLOCK: [2025-01-07 Di 11:58]--[2025-01-07 Di 12:18] =>  0:20
    CLOCK: [2024-12-27 Fr 17:40]--[2024-12-27 Fr 18:13] =>  0:33
    CLOCK: [2024-12-27 Fr 17:02]--[2024-12-27 Fr 17:28] =>  0:26
    CLOCK: [2024-12-25 Mi 17:26]--[2024-12-25 Mi 18:09] =>  0:43
    CLOCK: [2024-12-23 Mo 20:31]--[2024-12-23 Mo 21:42] =>  1:11
    :END:
    I'm gonna use SQLite, it's just too obvious a choice.
**** DONE How big should the pool be?
     CLOSED: [2025-02-10 Mo 20:55]
     :LOGBOOK:
     CLOCK: [2025-02-10 Mo 20:43]--[2025-02-10 Mo 20:55] =>  0:12
     :END:
**** TODO How often does the Database wait for a lock?
**** DONE Prune
     CLOSED: [2025-02-01 Sa 16:12]
     :LOGBOOK:
     CLOCK: [2025-02-01 Sa 14:45]--[2025-02-01 Sa 16:12] =>  1:27
     CLOCK: [2025-01-28 Di 15:10]--[2025-01-28 Di 15:35] =>  0:25
     :END:
     Would be nice to remove Files that no longer exist, as well as their
     associated metadata.
**** DONE Global connection pool
     CLOSED: [2025-02-03 Mo 18:49]
     :LOGBOOK:
     CLOCK: [2025-02-03 Mo 18:23]--[2025-02-03 Mo 18:49] =>  0:26
     :END:
     It's just the logical conclusion
**** CANCELLED Relative paths
     CLOSED: [2024-12-30 Mo 20:22]
     :LOGBOOK:
     CLOCK: [2024-12-30 Mo 18:13]--[2024-12-30 Mo 20:22] =>  2:09
     :END:
     I am not sure if this has enough impact to matter, but I could save some
     disk space if I stored the paths of Files only relative to their root
     directories.
     [2024-12-30 Mo 20:38]
     It is more trouble than it's worth.
*** Blacklist [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-01-07 Di 11:06]--[2025-01-07 Di 11:25] =>  0:19
    CLOCK: [2025-01-06 Mo 18:03]--[2025-01-06 Mo 19:00] =>  0:57
    CLOCK: [2024-12-27 Fr 19:15]--[2024-12-27 Fr 19:19] =>  0:04
    CLOCK: [2024-12-23 Mo 18:55]--[2024-12-23 Mo 19:56] =>  1:01
    CLOCK: [2024-12-22 So 16:10]--[2024-12-22 So 16:40] =>  0:30
    :END:
*** Walker [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-02-10 Mo 19:40]--[2025-02-10 Mo 19:50] =>  0:10
    CLOCK: [2025-01-07 Di 18:43]--[2025-01-07 Di 20:49] =>  2:06
    CLOCK: [2025-01-06 Mo 16:51]--[2025-01-06 Mo 17:41] =>  0:50
    CLOCK: [2024-12-28 Sa 14:44]--[2024-12-28 Sa 18:50] =>  4:06
    CLOCK: [2024-12-27 Fr 19:21]--[2024-12-27 Fr 22:42] =>  3:21
    CLOCK: [2024-12-23 Mo 20:05]--[2024-12-23 Mo 20:30] =>  0:25
    :END:
    How / when do I want to run the Walker? Periodically? On command?
    I think on command is sufficient for now, I can add some periodic
    execution later on.
*** Extractor [1/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-01-24 Fr 11:58]--[2025-01-24 Fr 12:32] =>  0:34
    CLOCK: [2025-01-17 Fr 17:37]--[2025-01-17 Fr 18:39] =>  1:02
    CLOCK: [2025-01-16 Do 17:16]--[2025-01-16 Do 19:16] =>  2:00
    CLOCK: [2025-01-15 Mi 13:09]--[2025-01-15 Mi 14:52] =>  1:43
    CLOCK: [2025-01-15 Mi 08:20]--[2025-01-15 Mi 09:41] =>  1:21
    CLOCK: [2025-01-14 Di 17:42]--[2025-01-14 Di 19:08] =>  1:26
    CLOCK: [2025-01-14 Di 05:21]--[2025-01-14 Di 07:29] =>  2:08
    CLOCK: [2025-01-13 Mo 15:26]--[2025-01-13 Mo 15:50] =>  0:24
    CLOCK: [2025-01-13 Mo 14:39]--[2025-01-13 Mo 15:17] =>  0:38
    CLOCK: [2025-01-11 Sa 16:59]--[2025-01-11 Sa 17:55] =>  0:56
    CLOCK: [2025-01-10 Fr 20:43]--[2025-01-10 Fr 20:43] =>  0:00
    CLOCK: [2025-01-10 Fr 18:11]--[2025-01-10 Fr 19:30] =>  1:19
    CLOCK: [2025-01-10 Fr 17:54]--[2025-01-10 Fr 17:55] =>  0:01
    CLOCK: [2025-01-08 Mi 18:12]--[2025-01-08 Mi 22:57] =>  4:45
    CLOCK: [2025-01-08 Mi 17:50]--[2025-01-08 Mi 18:06] =>  0:16
    :END:
    The extractor attempts to get as much usable metadata and/or file content
    to index as possible.

    I am not entirely sure yet how I want to represent the data I get. I am
    thinking I might want to have some sort of structure beyond just a chunk
    of text. I'm thinking JSON? I have been meaning to play with SQLite's JSON
    handling, this could be a good opportunity to get acquainted with it.
**** DONE Resolution of images and possibly videos?
     CLOSED: [2025-02-08 Sa 16:41]
     :LOGBOOK:
     CLOCK: [2025-02-08 Sa 15:30]--[2025-02-08 Sa 16:41] =>  1:11
     CLOCK: [2025-02-07 Fr 18:32]--[2025-02-07 Fr 20:10] =>  1:38
     :END:
     I currently do not get valid resolutions for images, and none at all for
     videos. It would be nice to get accurate data, or why even bother?
**** Miming
     Running my application on a few representative directory trees, I get the
     following distribution of MIME types:
     | Type                                           | Count |
     | image/jpeg                                     |  8770 |
     | image/png                                      |  2444 |
     | application/json                               |  1250 |
     | image/gif                                      |   293 |
     | text/plain; charset=utf-8                      |   260 |
     | application/octet-stream                       |   191 |
     | application/pdf                                |   113 |
     | video/mp4                                      |    39 |
     | application/epub+zip                           |    26 |
     | image/tiff                                     |    13 |
     | image/webp                                     |    12 |
     | application/vnd.oasis.opendocument.text        |    10 |
     | application/gzip                               |     7 |
     | text/x-python                                  |     6 |
     | text/x-perl                                    |     5 |
     | text/tab-separated-values                      |     5 |
     | image/x-xcf                                    |     5 |
     | audio/mpeg                                     |     5 |
     | application/zstd                               |     5 |
     | application/vnd.oasis.opendocument.spreadsheet |     5 |
     | text/html; charset=utf-8                       |     4 |
     | image/svg+xml                                  |     4 |
     | audio/ogg                                      |     4 |
     | application/vnd.sqlite3                        |     4 |
     | application/x-bzip2                            |     3 |
     | text/plain                                     |     2 |
     | image/bmp                                      |     2 |
     | application/x-xz                               |     2 |
     | video/x-matroska                               |     1 |
     | video/webm                                     |     1 |
     | text/xml; charset=utf-8                        |     1 |
     | text/x-lua                                     |     1 |
     | text/plain; charset=iso-8859-1                 |     1 |
     | text/csv                                       |     1 |
     | image/x-icon                                   |     1 |
     | image/heif                                     |     1 |
     | image/avif                                     |     1 |
     | audio/mp4                                      |     1 |
     | application/zip                                |     1 |
     |------------------------------------------------+-------|

*** UI [0/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-02-06 Do 17:47]--[2025-02-06 Do 17:55] =>  0:08
    CLOCK: [2025-02-05 Mi 18:20]--[2025-02-05 Mi 19:45] =>  1:25
    CLOCK: [2025-01-13 Mo 17:41]--[2025-01-13 Mo 18:17] =>  0:36
    CLOCK: [2025-01-04 Sa 14:46]--[2025-01-04 Sa 17:34] =>  2:48
    CLOCK: [2025-01-04 Sa 14:07]--[2025-01-04 Sa 14:46] =>  0:39
    CLOCK: [2025-01-03 Fr 18:40]--[2025-01-03 Fr 23:03] =>  4:23
    CLOCK: [2025-01-02 Do 18:49]--[2025-01-02 Do 22:42] =>  3:53
    CLOCK: [2024-12-31 Di 17:41]--[2024-12-31 Di 20:04] =>  2:23
    CLOCK: [2024-12-30 Mo 20:56]--[2024-12-30 Mo 21:30] =>  0:34
    :END:
    I think I am going to have two panels (notebooks), one for the Roots and
    the respective files, and the second one for searching.
    Nah, by now we have 4 - one for the root directories, one for the files,
    one for searching, one for the blacklist.
**** TODO Edit Blacklist from GUI
     :LOGBOOK:
     CLOCK: [2025-01-07 Di 17:53]--[2025-01-07 Di 18:36] =>  0:43
     :END:
*** Searching [0/2]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-02-03 Mo 19:05]--[2025-02-03 Mo 19:58] =>  0:53
    CLOCK: [2025-01-23 Do 15:18]--[2025-01-23 Do 17:00] =>  1:42
    CLOCK: [2025-01-22 Mi 14:20]--[2025-01-22 Mi 15:31] =>  1:11
    CLOCK: [2025-01-20 Mo 20:17]--[2025-01-20 Mo 23:32] =>  3:15
    :END:
    This is, after all, the big point of all the effort we have taken up to
    this point.
    SQLite has support for fulltext search, so I should be using it, yes?
**** TODO [#D] Better UI
     I want a richer UI for searching, allowing me to filter by type,
     metadata, etc.
**** TODO Ranking results
     SQLite provides some functionality to build your own ranking method, but
     nothing I can just use out of the box. I'll have to look into that more
     deeply.
** Bugs [1/1]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** DONE GUI hangs after extractor runs
    CLOSED: [2025-01-20 Mo 17:01]
    :LOGBOOK:
    CLOCK: [2025-01-20 Mo 15:30]--[2025-01-20 Mo 17:01] =>  1:31
    CLOCK: [2025-01-17 Fr 18:47]--[2025-01-17 Fr 22:20] =>  3:33
    :END:
    I remember having a similar problem before, and that it probably
    originated in the Gtk runtime.
    The other day, I read somewhere that Gtk wasn't thread-safe. So I did my
    best to ensure that only the main goroutine touches the GUI directly, and
    that everybody else only does so indirectly.
    On a first test run, it *appears* to have worked. The GUI no longer hangs.
